doc: improve diagrams with mermaid
